When I ran a test with `default_branch = "master`, the existing repos that have branches other than `master` (e.g. stable) have `main` as the value for their source branch (even though the main branch doesn't exist).

Example:
```hcl
# module.github_repos["..."].github_branch.default["stable"] must be replaced
-/+ resource "github_branch" "default" {
        branch        = "stable"
      ~ etag          = "..." -> (known after apply)
      ~ id            = "...:stable" -> (known after apply)
      ~ ref           = "refs/heads/stable" -> (known after apply)
        repository    = "..."
      ~ sha           = "..." -> (known after apply)
      ~ source_branch = "main" -> "master" # forces replacement
      + source_sha    = (known after apply)
```
Have made a change to support overriding the default branch as a source only when necessary.

Let me know what you think of it. 